from pprint import pprint

############################
# книжная колекция
############################

############################
# автор, название книги, жанр, год выпуска, количество страниц, издательство. 
############################


data = {
    "автор": 0,
    "жанр": 1,
    "год выпуска": 2,
    "Количество страниц": 3,
    "Издательство": 4
}

book_collection = {
    "Винни Пух": ["Алан Александр Милн", "стихи", 1926, 400, "Лондон ивнинг ньюс"],
    "Властелин Колец": ["Джон Толкин", "фэнтэзи", 1955, 1200, "George Allen & Unwin"],
    "Унесённые ветром": ["Маргарет Митчелл", "роман", 1936, 1080, "New York: Pocket books"],
    "Сто лет одиночества": ["Габриэль Гарсиа Маркес", "магический реализм", 1967, 368, "Editorial Sudamericana"],
    "Великий Гэтсби": ["Фрэнсиса Скотта Фицджеральда", "роман", 1925, 256, "Scribner's"],

}

############################
# добавление
############################

new_book = {
    "Гарри Поттер": ["Дж.Роулинг", "фэнтэзи", "1997", "390", "Bloomsbury"]
}

book_collection.update(new_book)

############################
# удаление
############################

del book_collection ["Винни Пух"]

############################
# замена данных
############################

book_collection ["Пение птиц"] = ["С. Фолкс", "роман", "1987", "1000", "Hutchinson"]

pprint(book_collection)

############################
# поиск
############################

search_b = input("Я ищу книгу :")
if search_b in book_collection.keys():
    book = book_collection.get(search_b)
    print("Данные о вашей книге:", {book[0]}, {book[1]}, {book[2]}, {book[3]}, {book[4]})
else:
    print("К сожалению, вашей книги нет в нашей коллекции")




