from pprint import pprint

############################
# Фирма
############################

############################
# ФИО, телефон, рабочий email, название должности, номер кабинета, skype.
############################

workers = {
    "Иван Петров": ["0677777777", "ivanpetrov@gmail.com", "администратор", "1", "Vanya"],
    "Рома Пупкин": ["0678888888", "romapupkin@gmail.com", "старший администратор", "2", "Roma"],
    "Вася Петров": ["0679999999", "vasyapetrov@gmail.com", "директор", "3", "Vasya"],
    "Ольга Васильевна": ["0670000000", "olga@gmail.com", "HR", "4", "Olga"]
 
}

############################
# добавление
############################

new_worker = {
    "Виктория Тайгреберт": ["0675555555", "viktoria@gmail.com", "вице-призидент", "7", "Vika"]
}
workers.update(new_worker)

############################
# удаление
############################

del workers ["Иван Петров"]

############################
# замена данных
############################

workers["Виктория Тайгреберт"] = ["0675555555", "viktoria@gmail.com", "вице-призидент", "7", "Vikulya"]


############################
# поиск
############################

search_p = input("Я ищу сотрудника, ФИО :")
if search_p in workers.keys():
    person = workers.get(search_p)
    print("Данные сотрудника:", {person[0]}, {person[1]}, {person[2]}, {person[3]}, {person[4]})
else:
    print("Данный сотрудник не найден в базе")