a = (1, 2, 3, 5, 7, 10)
b = (3, 5, 7, 10, 15, 20)
c = (5, 7, 8, 10, 20, 15)
print(a, b, c)


#######################
# элементы, которые есть во всех кортежах
#######################

abc = tuple(set(a) & set(b) & set(c))

print(abc)

#######################
# уникальны для каждого списка
#######################

diff_abc_1 = list(set(a) - set(b) - set(c))
diff_abc_2 = list(set(b) - set(a) - set(c))
diff_abc_3 = list(set(c) - set(a) - set(b))

print(diff_abc_1)
print(diff_abc_2)
print(diff_abc_3)


#######################
# эле- менты, которые есть в каждом из кортежей и находятся в каждом из кортежей на той же позиции
#######################

print(a[2])
print(b[2])
print(c[2])